Заменены PlantUML на Mermaid диаграммы в README.md seaf-core
