--- a/_metamodel_/seaf-core/README.md
+++ b/_metamodel_/seaf-core/README.md
@@ -162,37 +166,30 @@ ru.yandex.app.search
 Для удобства разработчиков, архкод развиваемый командой, допускается расположить непосредственно в 
 репозиториях микросервисов.
 
-```plantuml
-@startuml
-title Управление сегментами архкода
-actor "Team 1" as team_a
-actor "Team 2" as team_b
-participant "[[https://dochub.info/ DocHub]]" as dochub
-database "Repo\nTeam 1" as repo_a
-database "Repo\nTeam 2" as repo_b
-database "Repo\nMetamodel" as metamodel
-database "Repo\nGeneral" as repo_main
+```mermaid
+sequenceDiagram
+    actor Team 1
+    actor Team 2
+    participant DocHub
+    participant Repo Metamodel
+    participant Repo Main
+    participant Repo 1
+    participant Repo 2
 
-group Обзор архитектуры
-    dochub <- repo_main: General
-    dochub <- metamodel: Метамодель
-    dochub <- repo_b: Архкод
-    dochub <- repo_a: Архкод
-    team_a <- dochub: Артефакты
-    team_b <- dochub: Артефакты
-end
+    alt Обзор архитектуры
+        Repo Metamodel->>DocHub: Метамодель
+        Repo Main->>DocHub: Концептуальная архитектура
+        Repo 1->>DocHub: Детальная архитектура
+        Repo 2->>DocHub: Детальная архитектура
+        DocHub->>Team 1: Артефакты
+        DocHub->>Team 2: Артефакты
+    end
 
-group Фокус на своем сегменте
-    dochub <- metamodel: Метамодель
-    dochub <- repo_a: Архкод
-    team_a <- dochub: Артефакты
-    dochub <- metamodel: Метамодель
-    dochub <- repo_b: Архкод
-    team_b <- dochub: Артефакты
-end
-
-@enduml
-
+    alt Фокус на свой домен
+        Repo Metamodel->>DocHub: Метамодель
+        Repo 1->>DocHub: Детальная архитектура
+        DocHub->>Team 1: Артефакты
+    end
 ```
 
 Связать репозитории и представить их в едином интерфейсе позволит референсный инструмент -
@@ -330,28 +327,26 @@ SEAF рассматривает федеративное управление а
 
 #### Процесс
 
-```plantuml
-@startuml
-title Процесс управления федерацией
-participant "Owner" as Master
-participant "Domain1" as Domain1
-participant "Domain2" as Domain2
-participant "Domain2.subdomain1" as subdomain1
-participant "Domain2.subdomain1" as subdomain2
+```mermaid
+sequenceDiagram
+    participant Owner
+    participant Domain1
+    participant Domain2
+    participant Domain2.subdomain1
+    participant Domain2.subdomain2
 
-group Контракт
-    Master -> Domain1: Данные о федерации
-    Master <- Domain1: Данные о домене
-    Master -> Domain2: Данные о федерации
-    Master <- Domain2: Данные о домене
-    Domain2 -> subdomain1: Данные о федерации
-    Domain2 <- subdomain1: Данные о домене
-    Domain2 -> subdomain2: Данные о федерации
-    Domain2 <- subdomain2: Данные о домене
-end
+    Owner->>Domain1: Информация о федерации
+    Domain1->>Owner: Информация о домене
 
-@enduml
+    Owner->>Domain2: Информация о федерации
 
+    Domain2->>Domain2.subdomain1: Информация о федерации
+    Domain2->>Domain2.subdomain2: Информация о федерации
+
+    Domain2.subdomain1->>Domain2: Информация о домене
+    Domain2.subdomain2->>Domain2: Информация о домене
+
+    Domain2->>Owner: Информация о домене
 ```
 
 ## Развитие фремворка
